# Задание 1.
a = int(input("Введите число:"))
if a > 0:
    print("Число положительное")
elif a < 0:
    print("Число отрицательное")
else:
    print("Число ноль")