# Задание 2.
a = int(input("Введите число месяца: "))
if a == 1:
    print("ЯНВАРЬ")
elif a == 2:
    print("ФЕВРАЛЬ")
elif a == 3:
    print("МАРТ")
elif a == 4:
    print("АПРЕЛЬ")
elif a == 5:
    print("МАЙ")
elif a == 6:
    print("ИЮНЬ")
elif a == 7:
    print("ИЮЛЬ")
elif a == 8:
    print("АВГУСТ")
elif a == 9:
    print("СЕНТЯБРЬ")
elif a == 10:
    print("ОКТЯБРЬ")
elif a == 11:
    print("НОЯБРЬ")
elif a == 12:
    print("ДЕКАБРЬ")
else:
    print("Некорректный ввод")





